src/testing/performance-test/8gb/siege/flash/siege-300-users-pc.txt
kraghupathi:flash$ siege -c 300 -r 1 -t 5M http://ccnsb06-iiith.vlabs.ac.in/exp6_10/IR_Powder_exp6.swf
[alert] Zip encoding disabled; siege requires zlib support to enable it
[error] CONFIG conflict: selected time and repetition based testing
defaulting to time-based testing: 300 seconds

================================================================
WARNING: The number of users is capped at 255.  To increase this
         limit, search your .siegerc file for 'limit' and change
         its value. Make sure you read the instructions there...
================================================================
** SIEGE 4.0.2
** Preparing 255 concurrent users for battle.
The server is now under siege...[error] socket: read error Connection reset by peer sock.c:539: Connection reset by peer
[error] socket: -164247808 connection timed out.: Connection timed out

Lifting the server siege...
Transactions:		        8930 hits
Availability:		       99.05 %
Elapsed time:		      299.53 secs
Data transferred:	     1406.93 MB
Response time:		        7.07 secs
Transaction rate:	       29.81 trans/sec
Throughput:		        4.70 MB/sec
Concurrency:		      210.79
Successful transactions:        8930
Failed transactions:	          86
Longest transaction:	       76.38
Shortest transaction:	        0.45
 
*** Error in `siege': munmap_chunk(): invalid pointer: 0x000055e496a998a0 ***