src/testing/performance-test/8gb/siege/flash/siege-50-users-pc.txt
kraghupathi:flash$ siege -c 50 -r 1 -t 5M http://ccnsb06-iiith.vlabs.ac.in/exp6_10/IR_Powder_exp6.swf
[alert] Zip encoding disabled; siege requires zlib support to enable it
[error] CONFIG conflict: selected time and repetition based testing
defaulting to time-based testing: 300 seconds
** SIEGE 4.0.2
** Preparing 50 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		        9553 hits
Availability:		      100.00 %
Elapsed time:		      299.32 secs
Data transferred:	     1505.08 MB
Response time:		        1.32 secs
Transaction rate:	       31.92 trans/sec
Throughput:		        5.03 MB/sec
Concurrency:		       42.06
Successful transactions:        9553
Failed transactions:	           0
Longest transaction:	        6.24
Shortest transaction:	        0.23
 
Segmentation fault